In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [6]:
inputs = df.drop("salary_more_then_100k", axis="columns")
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [7]:
target = df["salary_more_then_100k"]

In [8]:
from sklearn.preprocessing import LabelEncoder

le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [9]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [10]:
inputs

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [11]:
inputs_n = inputs.drop(['company', 'job', 'degree'], axis="columns")

In [13]:
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [14]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [15]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [16]:
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [17]:
model.score(inputs_n, target)

1.0

In [18]:
model.predict([[2, 1, 0]])

array([0], dtype=int64)

In [19]:
model.predict([[2, 1, 1]])

array([1], dtype=int64)

In [20]:
### Exercise

In [21]:
import pandas as pd

In [23]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
inputs = df.drop(['Survived','Name','SibSp','Ticket','Parch', 'Cabin', 'Embarked'], axis="columns")
target = df['Survived']

In [32]:
inputs.head()

   PassengerId  Pclass     Sex   Age     Fare
0            1       3    male  22.0   7.2500
1            2       1  female  38.0  71.2833
2            3       3  female  26.0   7.9250
3            4       1  female  35.0  53.1000
4            5       3    male  35.0   8.0500

In [33]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [34]:
from sklearn.preprocessing import LabelEncoder

In [36]:
le_sex = LabelEncoder()

In [42]:
inputs['Sex_n'] = le_sex.fit_transform(inputs['Sex'])

In [45]:
inputs.head()

   PassengerId  Pclass     Sex   Age     Fare  Sex_n
0            1       3    male  22.0   7.2500      1
1            2       1  female  38.0  71.2833      0
2            3       3  female  26.0   7.9250      0
3            4       1  female  35.0  53.1000      0
4            5       3    male  35.0   8.0500      1

In [47]:
inputs_n = inputs.drop('Sex', axis="columns")

In [56]:
inputs_n.Age = inputs_n.Age.fillna(inputs_n.Age.mean())

In [57]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [58]:
from sklearn import tree

In [59]:
model = tree.DecisionTreeClassifier()

In [60]:
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [61]:
model.score(inputs_n, target)

1.0

In [62]:
from sklearn.model_selection import train_test_split

In [79]:
X_train, X_test, y_train, y_test = train_test_split(inputs_n, target, test_size=0.2)

In [80]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [81]:
model.score(X_test, y_test)

0.7374301675977654